Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: གླང་བོ་རིན་པོ་ཆེ་ཆེན་པོ་རྡོ་རྗེ་རིན་པོ་ཆེའི་རིའི་གཟི་བརྗིད་ཅེས་བྱ་བ་འབྱུང་བར་གྱུར་ཏོ། །
en: A great precious elephant called Vajra­ratna­giri­tejas appeared.

source: རྟ་རིན་པོ་ཆེ་རི་སྔོ་རླུང་གི་ཤུགས་ཤེས་བྱ་བ་བྱུང་བར་གྱུར་ཏོ། །
en: A precious horse called Nīla­giryanila­vega appeared.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཉི་མའི་སྙིང་པོ་འོད་སྤྲིན་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏོ། །
en: A great precious jewel called Āditya­garbha­prabha­megha­rāja appeared.

source: བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་དེ་ཡང་བུད་མེད་རིན་པོ་ཆེར་བྱུང་བར་གྱུར་ཏོ། །
en: The girl Sucalita­rati­prabhāsa­śrī appeared as the precious queen.

source: ཁྱིམ་བདག་རིན་པོ་ཆེ་ནོར་ཀྱི་ཕུང་པོ་མང་པོ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏོ། །
en: A precious householder called Prabhūta­ghana­skandha appeared.

source: བློན་པོ་རིན་པོ་ཆེ་མིག་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་ཡང་བྱུང་བར་གྱུར་ཏོ། །
en: And seventh, a precious minister called Vimala­netra appeared.

source: དེ་ལྟར་བདུན་ནོ་དེ་དེ་ལྟར་རིན་པོ་ཆེ་བདུན་དང་ལྡན་པའི་རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ་གླིང་བཞི་ལ་དབང་བ་ཆོས་དང་ལྡན་པ།
en: “In that way, he became a cakravartin king, a possessor of the seven jewels, a sovereign over the four continents, a follower of the Dharma, a Dharma king, and a victor, endowed with the power and vigor of an empire.

source: ཆོས་ཀྱི་རྒྱལ་པོ་རྣམ་པར་རྒྱལ་བ་དང་ལྡན་པ་ཡུལ་གྱི་མཐུ་དང་བརྩོན་འགྲུས་སུ་ལྡན་པར་གྱུར་ཏེ། དེ་ལ་བུ་དཔའ་ལ་བརྟུལ་ཕོད་ཅིང་ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན་པ་ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་སྟོང་ཡོད་པར་གྱུར་ཏེ། དེས་ས་ཆེན་པོ་འདི་སྐྱོན་མེད་པ་དང་། དགྲ་མེད་པ་དང་། གནོད་པ་མེད་པ་དང་།
en: “He had a thousand sons who were courageous and heroic, with perfectly formed bodies, who could crush the armies of enemies.

source: འཚེ་བ་མེད་པ་དང་། སྐྱིད་པ་དང་ཕུན་སུམ་ཚོགས་པ་དང་། བདེ་བ་དང་ལོ་ལེགས་པ་དང་། མདངས་དགའ་བ་དང་། སྐྱེ་བོའི་མི་མང་པོས་ཡོངས་སུ་གང་བ་ཡང་རི་དང་རྒྱ་མཚོའི་མཐས་ཀླས་པར་ཆོས་ཀྱིས་མངོན་པར་བརྒྱན་ཏེ།
en: “He ruled the great land to the ends of the mountains and oceans, adorning it with the Dharma, and it was free of problems, without enemies, free of harm, without violence, thriving, prosperous, peaceful, with excellent harvests, joyful, and filled with many beings.

source: གནས་པར་བྱས་སོ། །དེ་ས་འཛམ་བུའི་གླིང་དེའི་རྒྱལ་པོའི་གནས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དག་ཏུ་ཡང་རྒྱལ་པོའི་གནས་རེ་རེར་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་བྱེད་དུ་བཙུད་དེ། ཐམས་ཅད་ཀྱང་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་ཤ་སྟག་གོ །
en: “There were eighty-four thousand royal capitals in that Jambudvīpa, and in each royal city five hundred vihāras were established, and all of them had all the best features.

source: ལོངས་སྤྱོད་དང་ཡོ་བྱད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པ་ཤ་སྟག་གོ །
en: They all had a perfection of all kinds of requisites and pleasures.

source: བཟའ་ཤིང་གི་ར་བ་དང་། ཁང་པ་དང་འཆག་ས་དང་། དུས་ཐམས་ཅད་དུ་བདེ་བར་སྤྱད་པའི་ནགས་ཚལ་གྱི་ཕྲེང་བས་རྣམ་པར་བརྒྱན་པ་ཤ་སྟག་གོ །
en: They all had gardens, buildings, and walkways and were adorned by rows of forests that could be enjoyed at all times.

source: གཙུག་ལག་ཁང་རེ་རེ་ཞིང་ཡང་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་བརྩིགས་པ་ནི་ལྷུན་གྱི་རྒྱ་ཤིན་ཏུ་ཆེ་བར་བྱས་པ་སྟེ། ནང་རིན་པོ་ཆེ་རྣམ་པ་མང་པོས་བརྒྱན་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་སྤྲས་པ་ཤ་སྟག་སྟེ།
en: “In each vihāra was erected a caitya of the Tathāgata as large as a mountain and adorned on the inside with many jewels and beautified by various kings of jewels.

source: རྒྱལ་པོའི་གནས་དེ་ཐམས་ཅད་དུའང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་འཁོར་དང་བཅས་པ། གྲོང་ཁྱེར་དུ་གཤེགས་པར་བྱ་བའི་ཕྱིར་སྤྱན་དྲངས་སོ། །
en: “The Tathāgata Sūrya­gātra­pravara and his followers were invited to come to all those royal cities.

source: རྒྱལ་པོའི་གནས་དེ་དག་ཀུན་ཏུ་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་མཆོད་པ་རྣམ་པ་ཐམས་ཅད་དུ་བསམ་གྱིས་མི་ཁྱབ་པ་མཆོད་དེ།
en: In all those royal cities, inconceivable offerings of every kind worthy of a tathāgata were made to that tathāgata.

source: སངས་རྒྱས་གྲོང་ཁྱེར་དུ་གཤེགས་པའི་ཆོ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པས་སེམས་ཅན་ཚད་མེད་པའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་གཤེགས་སུ་གསོལ་ཏོ། །
en: He was asked to come because the miraculous manifestations of a buddha’s entry into a town generated roots of merit in beings.

source: དེར་ཡང་སེམས་ཅན་མ་དད་པའི་སེམས་དང་ལྡན་པ་རྣམས་ནི་དད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Beings there who had no faith attained faith.

source: དད་པ་དང་ལྡན་པའི་སེམས་ཅད་རྣམས་ནི་སངས་རྒྱས་མཐོང་བས་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་གྱུར་ཏོ། །
en: Beings who had faith had an increased power of joy on seeing the buddha.

source: དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བའི་སེམས་ཅན་རྣམས་ནི་བྱང་ཆུབ་ཀྱི་བསམ་པ་རྣམ་པར་དག་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Beings who had an increased power of joy attained the pure aspiration to enlightenment.

source: བྱང་ཆུབ་ཀྱི་བསམ་པ་རྣམ་པར་དག་པའི་སེམས་ཅན་རྣམས་ནི་སྙིང་རྗེ་ཆེན་པོའི་སེམས་སྐྱེས་པར་གྱུར་ཏོ། །
en: Beings who had the pure aspiration to enlightenment developed the motivation of great compassion.

source: སེམས་ཅན་ལ་ཕན་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་པར་གྱུར་ཏོ། །
en: Beings who were engaged in benefiting beings became dedicated to seeking all the Dharma of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཚུལ་གྱི་རྣམ་པ་ལ་མཁས་པའི་སེམས་ཅན་རྣམས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སེམས་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ། །
en: Beings who were learned in the ways of the Dharma of the buddhas focused their minds on realizing the nature of all phenomena.

source: ཆོས་མཉམ་པ་ཉིད་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་འཇུག་པའི་ཕྱིར། སེམས་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ། །
en: Beings who had realized the equality of all phenomena focused their minds on realizing the equality of the three times.

source: དུས་གསུམ་གྱི་ཡེ་ཤེས་སྣང་བ་ཐོབ་པའི་སེམས་ཅན་རྣམས་ནི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་རྣམ་པར་དམྱིགས་པར་བྱ་བའི་དོན་དུ་ཡེ་ཤེས་སྣང་བ་ལ་ཞུགས་པར་གྱུར་ཏོ། །
en: Beings who had attained the illumination of the knowledge of the three times entered the light of wisdom in order to perceive the succession of buddhas.

source: དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་དོན་དུ་སེམས་ཅན་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ། །
en: The beings who had realized the perception of the various tathāgatas focused their minds on gathering all beings.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བ་ལ་བརྩོན་པའི་སེམས་ཅན་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་སྐྱེད་པར་གྱུར་ཏོ། །
en: The beings who were dedicated to gathering beings generated prayers to purify the bodhisattva path.

source: ལམ་གྱི་མཉམ་པ་ཉིད་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར་ཡེ་ཤེས་སྣང་བ་སྐྱེད་པར་གྱུར་ཏོ། །
en: Beings who had realized the equality of the path gave rise to the light of wisdom in order to attain the Dharma wheels of all the buddhas.

source: ཆོས་རྒྱ་མཚོ་རྣམ་པར་དབྱེ་བ་ལ་མངོན་པར་མོས་པའི་སེམས་ཅན་རྣམས་ནི་ཞིང་གི་དྲ་བ་ཐམས་ཅད་རང་གི་ལུས་ཀྱིས་རྒྱས་པར་གང་བའི་དོན་དུ་སེམས་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ། །
en: The beings who had turned toward the aspects of the ocean of the Dharma focused their minds on pervading the entire net of realms with their own bodies.

source: ཞིང་མཉམ་པ་ཉིད་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་འདེབས་པར་གྱུར་ཏོ། །
en: The beings who had realized the equality of the realms prayed to know the ocean of the capabilities of beings.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབང་པོ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དཔྱད་པ་ལ་བརྩོན་པའི་སེམས་ཅན་རྣམས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བསམ་པ་རྣམ་པར་དག་པར་གྱུར་ཏོ། །སེམས་ཅན་རྣམ་པ་དེ་ལྟ་བུ་དག་གི་དོན་རྣམ་པ་དེ་ལྟ་བུ་དེ་དག་འགྲུབ་པར་འགྱུར་བ་མཐོང་ནས།
en: The beings who were dedicated to analyzing exactly the aspirations and capabilities of beings purified the motivation to realize omniscience.

source: རྒྱལ་པོ་གཟི་བརྗིད་ཀྱི་བདག་པོས་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པར་བསྟན་པས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དོན་དུ་རྒྱལ་པོའི་གནས་དེ་དག་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་སྐུ་ཉི་མ་དམ་པ་གཤེགས་སུ་གསོལ་ཏོ། །
en: “King Tejodhipati, seeing that beings gained that kind of accomplishment of those kinds of goals, requested the Tathāgata Sūrya­gātra­pravara to come to all those royal cities in order to ripen and guide those beings through his inconceivable manifestations and miracles.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་བཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was Prince Tejodhipati?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ལ་དབང་བ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་ལ་བསྙེན་བཀུར་བྱེད་བྱེད་པ་དེ་ཡིན་ནོ། །
en: Do not think that it was anyone else, for at that time, in that time, the Bhagavat, the Tathāgata Śākyamuni was the Prince Tejodhipati who became the sovereign of a cakravartin’s kingdom and honored the Tathāgata Sūrya­gātra­pravara.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་ཡབ་དུ་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was King Dhanapati, the father of Prince Tejodhipati?

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་མེ་ཏོག་གི་འོད་ཅེས་བྱ་བ་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་ཞེས་བྱ་བར་གྱུར་པ་སྟེ།
en: Do not think that it was anyone else, for at that time, in that time, the Tathāgata Ratna­kusuma­prabha was King Dhanapati.

source: ད་ལྟར་ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་གཟུགས་བརྙན་གྱི་སྤྲིན་ཅེས་བྱ་བ་ན། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དབུ་མ་དུས་གསུམ་རབ་ཏུ་སྣང་བའི་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཡོངས་སུ་འབྱུང་བའི་དབྱིངས་ཤེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་དཔལ་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་ན། སྙིང་བོ་བྱང་ཆུབ་ཐམས་ཅད་ལ་དབང་བའི་ལུས་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཏེ།
en: He is now at a bodhimaṇḍa called Sarva­vaśita­kāya­pratibhāsa in a world realm called Buddha­prabhā­maṇḍala­śrī­pradīpā, which is in a central group of world realms called Tryadhva­pratibhāsa­maṇi­rāja­saṃbhavā, in an ocean of world realms called Dharma­dhātu­gagana­pratibhāsa­megha, which is to the east beyond an ocean of world realms as numerous as the atoms in an ocean of world realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱིས་བསྐོར་ཅིང་ཆོས་སྟོན་ཏོ། །
en: There he has attained the highest, complete enlightenment of buddhahood and is teaching the Dharma encircled by an assembly of bodhisattvas as numerous as the atoms in countless buddha realms.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་འོད་ཅེས་བྱ་བ་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་གཟུགས་བརྙན་དུ་སྣང་བའི་སྤྲིན་ཡོངས་སུ་དག་པར་མཛད་དེ།
en: “When the Bhagavat, the Tathāgata Ratna­kusuma­prabha, was previously practicing bodhisattva conduct, he purified the ocean of world realms called Dharma­dhātu­gagana­pratibhāsa­megha.

source: འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་དེར་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་པ་དང་། འབྱུང་བ་དང་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་མེ་ཏོག་གི་འོད་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨྱིན་པར་མཛད་པ་ཤ་སྟག་གོ །
en: All the tathāgatas who have appeared, are appearing, and will appear in that ocean of world realms were all ripened for the highest, complete enlightenment by the Bhagavat, the Tathāgata Ratna­kusuma­prabha, during his past practice of bodhisattva conduct.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བཙུན་མོ་པད་མོ་དཔལ་གྱི་སྙིང་པོ་འབྱུང་བ་ཞེས་བྱ་བ་བྱུང་སྟེ། གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་ཡུམ་དུ་གྱུར་པ་བུད་མེད་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་གཙོ་མོར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི། དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was the king’s queen Padma­śrī­garbha­saṃbhavā, the mother of Prince Tejodhipati, preeminent among the eighty-four thousand wives?

source: རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་ཡུམ་ལྷ་མོ་སྒྱུ་མ་བྱང་ཆུབ་སེམས་དཔའ་བསྐྱེད་བསྐྱེད་པ་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་སྣང་ཞིང་སྒྲིབ་པ་མེད་པ་ལ་རབ་ཏུ་གནས་པ། སྔོན་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་བསྒྲུབས་པ་མངོན་དུ་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྟན་པའི་ཚུལ་ལ་མཁས་པ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ནོར་གྱི་བདག་པའི་བཙུན་མོ་དམ་པ་པད་མོ་དཔལ་གྱི་སྙིང་པོ་འབྱུང་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Do not think that it was anyone else, noble one, for at that time, in that time, Māyādevī, the mother of the Bhagavat, who gave birth to the bodhisattva, who is established in the liberation of unobscured, complete illumination, who has directly perceived the accomplishments of tathāgatas in the past, who knows the visions of the births of all bodhisattvas, was King Dhanapati’s preeminent queen, Padma­śrī­garbha­saṃbhavā.

source: དེའི་ཚེ་དེའི་དུས་ན་སྤྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was Sudarśanā, the preeminent courtesan?

source: ཤཱཀྱ་ལག་ན་ཁར་བའི་ཆུང་མ་ཁོ་མོའི་མ་མིག་མཛེས་ཤེས་བྱ་བ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་སྤྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Do not think that it was anyone else, noble one, for at that time, in that time, my mother, Sunetrā, the wife of the Śākya Daṇḍapāṇi, was Sudarśanā, the preeminent courtesan.

source: དེའི་ཚེ་དེའི་དུས་ན་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ།
en: At that time, in that time, who was the girl Sucalita­rati­prabhāsa­śrī?

source: ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་བ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ། ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན། སྤྲུལ་འཚོང་མའི་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Do not think that it was anyone else, noble one, for at that time, in that time, I was Sucalita­rati­prabhāsa­śrī, the daughter of the courtesan.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་འཁོར་དུ་གྱུར་པ་དེ་རྣམས་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི། རིགས་ཀྱི་བུ་དེ་ནི་དེ་ལྟར་མི་བལྟ་སྟེ་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་དགོད་དགོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་འདི་ཉིད་ན་འཁོད་ཅིང་།
en: At that time, in that time, who were the entourage of King Tejodhipati?

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གཟུགས་བརྙན་རབ་ཏུ་བྱུང་བའི་ལུས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱོད་པ་ལས་མཉམས་པའི་སེམས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞལ་མངོན་དུ་མཐོང་བར་རྣམ་པར་དམྱིགས་པའི་མིག་དང་དེ་བཞིན་མིག་དང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསུང་གི་ཡན་ལག་གི་སྤྲིན་ནམ་མཁའ་དང་མཉམ་པའི་འཁོར་ལོ་རབ་ཏུ་བསྒྲགས་པའི་དབྱངས་རྣམ་པར་དམྱིགས་པའི་རྣ་བ་དང་། ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱད་པར་དབང་བསྒྱུར་བའི་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྗེས་སུ་གྲགས་པའི་མིང་གི་སྒྲ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ཉེ་བར་འགྲོ་བ་རྒྱུན་མི་གཅོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་སྟོན་པའི་ལུས་ཡོངས་སུ་སྨྱིན་བར་བྱ་བ་དང་། གདུལ་བ་ལ་རྗེས་སུ་མཐུན་པ་མངོན་པར་བསྒྲུབས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཡང་དག་པར་བསྒྲུབས་པ་ཕྱོགས་ཀྱི་དྲ་བ་མ་ལུས་པ་ཐམས་ཅད་དུ་འདལ་ཏེ། མ་འོངས་པའི་བསྐལ་པ་ཐམས་ཅད་དུ་རྒྱུན་མི་འཆད་པ་དང་ལྡན་པ་ཤ་སྟག །བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་འཁོད་པ་འདི་དག་ཡིན་ནོ། །
en: Do not think that they were anyone else, noble one, for they are now those who are established in this very assembly of followers who are bodhisattvas established by the Bhagavat in the perfection of the completely good conduct and prayer of bodhisattvas; whose bodies appeared as images in all world realms; whose minds never lapse from the practice of all bodhisattva samādhis; whose eyes have the perception of directly seeing the faces of all tathāgatas; whose ears perceive the voices of the clouds of the aspects of the speech, as vast as space, of all the tathāgatas that resound with the wheel of the Dharma; whose inhalations and exhalations have power over the practice of all Dharmas; the sound of whose names resound throughout all the buddha realms; whose bodhisattva bodies go without interruption to the circles of the assemblies of all the tathāgatas; who create bodies that manifest to all beings, in accordance with their aspirations, in ways that are favorable for ripening and guidance; and who, spreading throughout the entirety of the net of the directions, accomplish and perfect the completely good conduct and prayer continuously throughout all future kalpas and are present in the circle of the assembly of the Bhagavat.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་དེ་ནི་འཁོར་ལོས་སྒྱུར་བ་གཟི་བརྗིད་ཀྱི་བདག་པོ་དང་། ཁོ་མོས་ནམ་བཞུགས་ཀྱི་བར་དུ་ན་བཟའ་དང་བཤོས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་ཡོ་བྱད་ཀྱིས་བསྙེན་བཀུར་ཏོ། །
en: “Noble one, the cakravartin Tejodhipati and I served the Tathāgata Sūrya­gātra­pravara for as long as he lived, with clothing, food, alms, bedding, medicine during times of illness, and necessary articles.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཤིན་ཏུ་དང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Noble one, after the parinirvāṇa of the Tathāgata Sūrya­gātra­pravara, in that world realm there appeared in the world the tathāgata named Prasannagātra.

source: དེ་ཡང་ཁོ་མོ་ཅག་གིས་བསྙེན་བཀུར་ཏོ། རིམ་གྲོར་བྱས་སོ། །བསྟི་སྟང་དུ་བྱས་སོ། །ཕུ་དུད་དུ་བྱས་སོ། །མཆོད་དོ། །
en: We also served him, showed him respect, honored him, venerated him, and made offerings to him.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཀྱི་གཟུགས་བརྙན་གྱི་ཟླ་བ་སྣང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། དེ་ཡང་ཁོ་མོ་ཅིག་གིས་ལྷའི་དབང་པོར་གྱུར་ཏེ།
en: “Subsequently, we served the tathāgata named Jāmbū­nada­tejorāja who appeared in the world.

source: བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འཛམ་བུ་ཆུ་ཀླུང་གི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Lakṣaṇa­bhūṣita­gātra who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་མཚན་གྱིས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་སྣ་ཚོགས་འབར་བའི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Vicitra­raśmi­jvalana­candra who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་རྣམ་པར་གཟིགས་པའི་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Suvilokita­jñāna­ketu who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཆེན་པོའི་འོད་གཟེར་ཤིན་ཏུ་ཡངས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྟེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Vipula­mahā­jñāna­raśmi­rāja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་མཐུ་བོ་ཆེའི་བརྩོན་འགྲུས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Nārāyaṇa­vajra­vīrya who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གཞན་གྱིས་མི་ཐུབ་པའི་མཐུ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Aparājita­jñāna­sthāma who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རྣམ་པར་གཟིགས་པའི་ཡེ་ཤེས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Samanta­vilokita­jñāna who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དྲི་མ་མེད་པ་ཕུན་སུམ་ཚོགས་པའི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Vimala­śrī­megha who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Siṃha­vijṛmbhita­prabha who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་འབར་བའི་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Jñāna­raśmi­jvalana­cūḍa who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་འོད་གཟེར་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Guṇa­raśmi­dhvaja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཉི་མའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Jñāna­bhāskara­tejas who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་རིན་པོ་ཆེའི་པད་མོ་ཤིན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Ratna­padma­praphullita­gātra who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྒྲོན་མའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Puṇya­pradīpa­dhvaja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འོད་གཟེར་གྱི་སྤྲིན་གྱི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Jñāna­raśmi­megha­prabha who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རྣམ་པར་སྣང་བའི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Samanta­vairocana­candra who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྒྱན་དང་གདུགས་ཀྱི་དབྱངས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Ābharaṇacchatra­nirghoṣa­rāja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་སྣང་བས་རྣམ་པར་གནོན་པའི་སེང་གེ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Samanta­jñānāloka­vikrama­siṃha who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡུལ་གྱི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Dharma­dhātu­viṣaya­mati­candra who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ནམ་མཁའི་སེམས་སྣང་བའི་གཟུགས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Sattva­gagana­citta­pratibhāsa­bimba who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞི་བའི་སྤོས་ཀྱི་གཙུག་བཟང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Praśama­gandha­sunābha who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཞི་བའི་དབྱངས་ཀུན་ཏུ་བསྒྲགས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Samantānuravita­śānta­nirghoṣa who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རབ་ཏུ་བརྟན་པའི་འོད་གཟེར་གྱི་དྲ་བའི་གཟུགས་ཀྱི་ཕུང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Sudṛḍha­jñāna­raśmi­jāla­bimba­skandha who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་རི་བོའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Amṛta­parvata­prabhā­tejas who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོའི་འབྲུག་སྒྲ་སྒྲོག་པའི་དབྱངས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Dharma­sāgara­nigarjita­ghoṣa who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ནམ་མཁའ་སྣང་བའི་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Buddha­gagana­prabhāsa­cūḍa who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་ཟླ་བ་མཛོད་སྤུའི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Raśmi­candrorṇa­megha who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་ཞལ་ཤིན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Suparipūrṇa­jñāna­mukhaktra who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་མེ་ཏོག་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Suviśuddha­jñāna­kusumāvabhāsa who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོ་བའི་རི་བོ་དཔལ་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Ratnārciḥ­parvata­śrī­tejorāja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱ་ཆེན་པོ་གཟི་བརྗིད་ཀྱི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Vipula­guṇa­jyotiḥprabha who appeared in the world.
